#define _CRT_SECURE_NO_WARNINGS 1
////5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果 
////A选手说：B第二，我第三；
////B选手说：我第二，E第四；
////C选手说：我第一，D第二；
////D选手说：C最后，我第三；
////E选手说：我第四，A第一；
////比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//
#include<stdio.h>
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if (((2 == b) + (3 == a) == 1 && (b == 2) + (e == 4) == 1 && (c == 1) + (d == 2) == 1 &&(c == 5) + (d == 3) == 1 && (e == 4) + (a == 1) == 1) && (a*b*c*d*e == 120))
//							printf("a是%d b是%d c是%d d是%d e是%d\n", a, b, c, d, e);
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}

////2.
////日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。以下为4个嫌疑犯的供词。
////A说：不是我。
////B说：是C。
////C说：是D。
////D说：C在胡说
////已知3个人说了真话，1个人说的是假话。
////现在请根据这些信息，写一个程序来确定到底谁是凶手。
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	for (a = 0; a <= 1; a++)
//	{
//		for (b = 0; b <=1; b++)
//		{
//			for (c = 0; c <= 1; c++)
//			{
//				for (d = 0; d <= 1; d++)
//				{
//					if (((a == 0) + (c == 1) + (d == 1) + (d==0))==3&&(a+b+c+d==1))
//						printf("a=%d\nb=%d\nc=%d\nd=%d\n", a, b, c, d);
//				}
//			}
//
//		}
//	}
//	return 0;
//}

//3.在屏幕上打印杨辉三角。 
//1
//1 1
//1 2 1
//1 3 3 1

////int main()
////{
////	int row = 0;
////	int col = 0;
////	int arr[4][4] = {0};
////	for (row = 0; row < 4; row++)
////	{
////		arr[row][0] = 1;
////		arr[row][row] = 1;
////		for (col = 1; col < row; col++)
////		{
////			arr[row][col] = arr[row-1][col-1] + arr[row-1][col];
////		}
////	}
////	for (row = 0; row < 4; row++)
////	{
////		for (col = 0; col <= row; col++)
////		{
////			printf("%d ", arr[row][col]);
////		}
////		printf("\n");
////	}
////	return 0;
////}
////

//
//1.在屏幕上输出以下图案：
//       *
//      ***
//     *****
//    *******
//   *********
//  ***********
// *************
//  ***********
//   *********
//    *******
//     *****
//      ***
//       *

//int main()
//{
//	int i = 0;
//	int j = 0;
//	int k = 0;
//	for (i = 0; i <= 6; i++)
//	{
//		for (j = 0; j < 6-i; j++)
//			printf(" ");
//		for (k = 0; k <= 2 * i ; k++)
//			printf("*");
//		printf("\n");
//
//	}
//	for (i = 0; i <= 5; i++)
//	{
//		for (j = 0; j <= i; j++)
//			printf(" ");
//		for (k = 0; k < 11 - (2 * i);k++)
//			printf("*");
//		printf("\n");
//	}
//	return 0;
//}

//2.求出0～999之间的所有“水仙花数”并输出。
//“水仙花数”是指一个三位数，其各位数字的立方和确好等于该数本身，如；153＝1＋5＋3 ? ，则153是一个“水仙花数”。

/*
在数论中，水仙花数（Narcissistic number）也称为自恋数、自幂数、阿姆斯壮数或阿姆斯特朗数（Armstrong number），是指一N位数，其各个数之N次方和等于该数。
例如153、370、371及407就是三位数的水仙花数，其各个数之立方和等于该数：
153 = 1^3 + 5^3 + 3^3。
370 = 3^3 + 7^3 + 0^3。
371 = 3^3 + 7^3 + 1^3。
407 = 4^3 + 0^3 + 7^3。
*/

//#include<math.h>
//int main()
//{
//	int i = 0;
//	double num1, num2, num3;
//	for (i = 0; i < 1000; i++)
//	{
//		
//		num1 = pow(i / 100, 3);
//		num2 = pow(i % 100 / 10, 3);
//		num3 = pow(i % 10, 3);
//		if (num1 + num2 + num3 == i)
//			printf("%d ", i);
//	}
//	return 0;
//}

//3. 
//求Sn = a + aa + aaa + aaaa + aaaaa的前5项之和，其中a是一个数字，例如：2 + 22 + 222 + 2222 + 22222
//int main()
//{
//	int i = 0;
//	int Sn = 0;
//	int num = 0;
//	int k = 0;
//	scanf("%d",&num);
//	for (i = 0; i < 5;i++)
//	{
//		k = 10 * k + num;
//		printf("%d ", k);
//		Sn += k;
//	}
//	printf("Sn=%d\n", Sn);
//	return 0;
//}

//day 13   1.调整数组使奇数全部都位于偶数前面。
//题目：
//输入一个整数数组，实现一个函数，来调整该数组中数字的顺序使得数组中所有的奇数位于数组的前半部分，
//所有偶数位于数组的后半部分。


//int main()
//{
//	int arr[10] = { 10, 25, 5, 8, 65, 14, 78, 1, 19, 3 };
//	int i = 0;
//	int j = 9;
//	int tmp = 0;
//	while (i < j)
//	{
//		if ((i < j)&&(arr[i] % 2 != 0))
//			i++;
//		if ((i < j)&&(arr[j] % 2 == 0))
//			j--;
//		if (i < j)
//		{
//			tmp = arr[i];
//			arr[i] = arr[j];
//			arr[j] = tmp;
//		}
//	}
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ",arr[i]);
//	}
//	return 0;
//}


//杨氏矩阵 
//2.有一个二维数组.数组的每行从左到右是递增的，每列从上到下是递增的.在这样的数组中查找一个数字是否存在。时间复杂度小于O(N);
//数组：
//1 2 3
//2 3 4
//3 4 5
//
//
//1 3 4
//2 4 5 
//4 5 6
//
//1 2 3
//4 5 6
//7 8 9
//

//int main()
//{
//	int arr[3][3] = { { 1, 2, 3 }, { 2, 3, 4 }, { 3, 4, 5 } };
//	int i = 0;
//	int j = 2;
//	int k = 0;
//	scanf("%d", &k);
//	while (i >= 0 && i < 3 && j >= 0 && j < 3)
//	{
//		if (k > arr[i][j])
//			i++;
//		else if (k < arr[i][j])
//			j--;
//		else
//		{
//			printf("找到了！");
//			break;
//		}
//	}
//	if (i>=3 || j >=3)
//		printf("找不到！");	
//	return 0;
//}